{"id": "doc_001", "text": "Flight log entry dated March 2001. Private aircraft departed from Teterboro Airport, New Jersey. Passenger manifest includes initials only. Destination: Palm Beach International Airport, Florida.", "metadata": {"type": "flight_log", "date": "2001-03"}}
{"id": "doc_002", "text": "Deposition transcript excerpt. Witness describes employment arrangement at Palm Beach residence. Position: household staff. Employment period: 1998-2002. No specific allegations in this section.", "metadata": {"type": "deposition", "date": "2006"}}
{"id": "doc_003", "text": "Property records show transfer of Manhattan residence. 9 East 71st Street, New York. Transaction date: 1989. Listed as personal residence. Property valued at approximately 50 million USD.", "metadata": {"type": "property_record", "date": "1989"}}
{"id": "doc_004", "text": "Business filing documents. Financial services company registered in U.S. Virgin Islands. Company purpose: investment management. Registration date: 1988. Principal office: St. Thomas.", "metadata": {"type": "business_filing", "date": "1988"}}
{"id": "doc_005", "text": "Court document summary. Civil lawsuit filed in Palm Beach County. Case type: personal injury. Filed: 2008. Status: settled. Terms confidential.", "metadata": {"type": "court_document", "date": "2008"}}
{"id": "doc_006", "text": "FBI case summary. Investigation initiated 2005. Field office: Palm Beach. Case status: closed. Charges: solicitation. Plea agreement reached 2008.", "metadata": {"type": "fbi_summary", "date": "2008"}}
{"id": "doc_007", "text": "Flight manifest data. Aircraft type: Boeing 727. Registration: N908JE. Common routes: New York, Palm Beach, Caribbean destinations. Operated 1986-2003.", "metadata": {"type": "flight_manifest", "date": "2003"}}
{"id": "doc_008", "text": "Foundation records. Non-profit organization established 2000. Purpose: education and science funding. Annual grants distributed: approximately 1 million USD. Dissolved 2007.", "metadata": {"type": "foundation_record", "date": "2007"}}
{"id": "doc_009", "text": "Interview transcript summary. Subject discussed financial advisory services provided to high-net-worth clients. Period: 1990s. No allegations discussed in this segment.", "metadata": {"type": "interview", "date": "2019"}}
{"id": "doc_010", "text": "Property documentation. Island property in U.S. Virgin Islands. Great St. James Island acquired 2016. Separate from main residence property.", "metadata": {"type": "property_record", "date": "2016"}}
